Repository: Fatmanurkntr/CuisineScanAPI
Catalog: mobile/lib/l10n/app_*.arb
Languages: tr

# homeHeroTitle
source: Scan Your Food, Taste the World.
tr: Yemeğini Tanı, Dünyayı Tat.

# homeHeroSubtitle
source: Discover food and its culture from photos with AI.
tr: Yapay zeka ile fotoğraftan yemekleri ve kültürlerini keşfet.

# homeStartScanning
source: Start Scanning
tr: Taramayı Başlat

# homeFeaturedTitle
source: Explore Featured Flavors
tr: Öne Çıkan Lezzetleri Keşfet

# homeFeaturedSubtitle
source: Some of the popular dishes our application can recognize.
tr: Uygulamamızın tanıyabildiği popüler yemeklerden bazıları.

# tabHome
source: Home
tr: Ana Sayfa

# tabScan
source: Scan
tr: Tara

# tabHistory
source: History
tr: Geçmiş

# tabProfile
source: Profile
tr: Profil

# selectionTitle
source: What would you like to scan?
tr: Ne Taramak İstersiniz?

# selectionTurkishFood
source: Turkish Cuisine
tr: Türk Mutfağı

# selectionTurkishFoodSubtitle
source: Recognize traditional dishes and plates.
tr: Geleneksel yemekleri ve tabakları tanıyın.

# selectionFruitVeg
source: Fruit & Vegetable
tr: Meyve & Sebze

# selectionFruitVegSubtitle
source: Recognize a single fruit or vegetable.
tr: Tek bir meyve veya sebzeyi tanıyın.

# scanTitleTurkish
source: Scan Turkish Cuisine
tr: Türk Mutfağı Tara

# scanTitleFruitVeg
source: Scan Fruit & Veg
tr: Meyve & Sebze Tara

# previewTitle
source: Preview
tr: Önizleme

# previewUseThisPhoto
source: Use This Photo
tr: Bu Fotoğrafı Kullan

# previewRetry
source: Retry
tr: Yeniden

# resultsTitle
source: Scan Result
tr: Tarama Sonucu

# resultsBestGuess
source: Best Guess
tr: En İyi Tahmin

# resultsConfidence
source: {confidence}% Confidence
tr: %{confidence} Güven Oranı

# resultsDescription
source: Description
tr: Açıklama

# resultsHistory
source: History
tr: Tarihçe

# resultsIngredients
source: Main Ingredients
tr: Ana Malzemeler

# resultsNutrition
source: Average Nutrition
tr: Ortalama Besin Değeri

# resultsCalories
source: Estimated Calories
tr: Tahmini Kalori

# resultsServing
source: for a portion of ~{servingSize}g
tr: yaklaşık {servingSize}g porsiyon için

# resultsDetailsNotFound
source: Detailed information could not be found for this item.
tr: Bu yiyecek için detaylı bilgi bulunamadı.

source: Small
tr: Küçük

source: Standard
tr: Standart

source: Large
tr: Büyük

# saveToHistoryButton
source: Save to History
tr: Geçmişe Kaydet

source: Language Selection
tr: Dil Seçimi

# profileInfoTitle
source: Profile Information
tr: Profil Bilgileri

# logoutButton
source: Log Out
tr: Çıkış Yap

# logoutMessage
source: Logged out successfully!
tr: Başarıyla çıkış yapıldı!

# settingsTitle
source: Settings
tr: Ayarlar

# historyEmptyTitle
source: No History Yet
tr: Henüz Geçmiş Yok

# historyEmptySubtitle
source: Your scanned items will appear here. Start scanning to build your collection!
tr: Taradığınız öğeler burada görünecek. Koleksiyonunuzu oluşturmak için taramaya başlayın!

# tabExplore
source: Explore
tr: Keşfet

# explorePageTitle
source: Discover New Tastes
tr: Yeni Lezzetler Keşfet

# explorePageSubtitle
source: Discovery feature coming soon!
tr: Keşfet özelliği yakında gelecek!

source: See All
tr: Tümünü Gör

# saveSuccessMessage
source: Successfully saved to history!
tr: Geçmişe başarıyla kaydedildi!

# saveErrorMessage
source: Could not save to history. Please try again.
tr: Geçmişe kaydedilemedi. Lütfen tekrar deneyin.
